In [1]:
import pandas as pd

In [ ]:
df = pd.read_csv('placement.csv', sep=',')
df.head(10)

In [26]:
tf = pd.read_csv('sample-2.tsv', sep='\t', names=['serials', 'budget', 'nan'])
tf

,serials,budget,nan
0,s1,Annual budget tracker,NaN
1,s2,Plan and track your monthly spending for the e...,NaN
2,s3,NaN,NaN
3,s4,NaN,NaN
4,s5,How to use this template,NaN
5,s6,1.,Get started by entering your starting balance ...
6,s7,2.,"Then, fill out the 'Expenses' and 'Income' tabs."
7,s7,3.,Feel free to rename or delete categories in th...
8,s8,NaN,NaN
9,s9,NaN,NaN
10,s10,Configure,NaN
11,s11,Starting balance:,"$5,000"

In [78]:
gh = pd.read_csv('sample-2.tsv', sep='\t', names=['s', 'b'], on_bad_lines='skip')
gh.info()

<class 'pandas.core.frame.DataFrame'>
Index: 12 entries, s1 to s11
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   s       8 non-null      object
 1   b       4 non-null      object
dtypes: object(2)
memory usage: 288.0+ bytes

In [39]:
gh = pd.read_csv('sample-2.tsv', sep='\t', header=0)
gh

,s1,Annual budget tracker,Unnamed: 2
0,s2,Plan and track your monthly spending for the e...,NaN
1,s3,NaN,NaN
2,s4,NaN,NaN
3,s5,How to use this template,NaN
4,s6,1.,Get started by entering your starting balance ...
5,s7,2.,"Then, fill out the 'Expenses' and 'Income' tabs."
6,s7,3.,Feel free to rename or delete categories in th...
7,s8,NaN,NaN
8,s9,NaN,NaN
9,s10,Configure,NaN
10,s11,Starting balance:,"$5,000"

In [70]:
df = pd.read_csv("placement.csv", names=['cgpa', 'package'], header=0, nrows=4)
df

   cgpa  package
0  6.89     3.26
1  5.12     1.98
2  7.82     3.25
3  7.42     3.67

In [64]:
df = pd.read_csv("placement.csv", names=['cgpa', 'package'], header=0)
df

     cgpa  package
0    6.89     3.26
1    5.12     1.98
2    7.82     3.25
3    7.42     3.67
4    6.94     3.57
..    ...      ...
195  6.93     2.46
196  5.89     2.57
197  7.21     3.24
198  7.63     3.96
199  6.22     2.33

[200 rows x 2 columns]

In [89]:
ff = pd.read_csv('placement.csv')
ff['package'] = ff['package'].astype(int, errors='ignore')
ff['package']

0      3
1      1
2      3
3      3
4      3
      ..
195    2
196    2
197    3
198    3
199    2
Name: package, Length: 200, dtype: int64

In [90]:
##Convert function

def rename(package):
    if package == 1:
        return 10
    else:
        return package

In [94]:
ppp = pd.read_csv('placement.csv')
ppp['package'] = ppp['package'].astype(int, errors='ignore')
ppp['package'] = ppp['package'].apply(rename)
ppp['package']

0       3
1      10
2       3
3       3
4       3
       ..
195     2
196     2
197     3
198     3
199     2
Name: package, Length: 200, dtype: int64

In [100]:
def rename(package):
    if package == '3.26':
        return '10.0'
    else:
        return package
ppp = pd.read_csv('placement.csv', converters={'package': rename})
ppp

     cgpa package
0    6.89    10.0
1    5.12    1.98
2    7.82    3.25
3    7.42    3.67
4    6.94    3.57
..    ...     ...
195  6.93    2.46
196  5.89    2.57
197  7.21    3.24
198  7.63    3.96
199  6.22    2.33

[200 rows x 2 columns]